招式库={}
function 招式库.站振(){
	--print("1")--直接写按下G
	km.按下(0xA)--G
	km.弹起(0xA)
}
function 招式库.拼刀(){
	local 左键状态=km.是否按下(1)
	local 右键状态=km.是否按下(2)
	--鼠标必须先屏蔽,才能接管鼠标
	if(左键状态) then 
		km.屏蔽左键(1)
		km.左键(0)
		km.屏蔽左键(0)
	end--左键
	if(右键状态) then 
		km.屏蔽右键(1)
		km.右键(0)
		km.屏蔽右键(0)
	end--右键
}
--这里添加其他处理方式

招式库={
	[武器库.武器_长剑] = {
        ["male_sw_attack_light_03"] = {
            描述 = "左三连",
            站立_最小振刀角度 = 0,
            站立_最大振刀角度 = 25,
            站立_最近振刀距离 = 0,
            站立_最远振刀距离 = 4,
            站立_振刀延迟 = 0,
            站立_振刀方式 = 招式库.站振,
            站立_触发武器 = {-1},
			站立_执行次数 = 10,
            站立_执行延迟 = 25,
			
			蓄转_最小振刀角度 = 0,
            蓄转_最大振刀角度 = 25,
            蓄转_最近振刀距离 = 0,
            蓄转_最远振刀距离 = 4,
            蓄转_振刀延迟 = 0,
            蓄转_振刀方式 = 招式库.站振,
			蓄转_触发武器 = {-1},
			蓄转_执行次数 = 1,
            蓄转_执行延迟 = 0,
			
			先进_最小振刀角度 = 0,
            先进_最大振刀角度 = 25,
            先进_最近振刀距离 = 0,
            先进_最远振刀距离 = 4,
            先进_振刀延迟 = 0,
            先进_振刀方式 = 招式库.拼刀,
			先进_触发武器 = {-1},
			先进_执行次数 = 1,
            先进_执行延迟 = 0
        },
		["male_sw_attack_heavy_03"] = {
            描述 = "右三连",
            站立_最小振刀角度 = 0,
            站立_最大振刀角度 = 25,
            站立_最近振刀距离 = 0,
            站立_最远振刀距离 = 4,
            站立_振刀延迟 = 0,
            站立_振刀方式 = 招式库.站振,
            站立_触发武器 = {-1},
			站立_执行次数 = 10,
            站立_执行延迟 = 25,
			
			蓄转_最小振刀角度 = 0,
            蓄转_最大振刀角度 = 25,
            蓄转_最近振刀距离 = 0,
            蓄转_最远振刀距离 = 4,
            蓄转_振刀延迟 = 0,
            蓄转_振刀方式 = 招式库.站振,
			蓄转_触发武器 = {-1},
			蓄转_执行次数 = 1,
            蓄转_执行延迟 = 0,
			
			先进_最小振刀角度 = 0,
            先进_最大振刀角度 = 25,
            先进_最近振刀距离 = 0,
            先进_最远振刀距离 = 4,
            先进_振刀延迟 = 0,
            先进_振刀方式 = 招式库.拼刀,
			先进_触发武器 = {-1},
			先进_执行次数 = 1,
            先进_执行延迟 = 0
        }--这里打个,然后继续添加其他招式
}
招式库={
	[武器库.武器_太刀] = {
        ["male_katana_attack_light_03"] = {
            描述 = "左三连",
            站立_最小振刀角度 = 0,
            站立_最大振刀角度 = 25,
            站立_最近振刀距离 = 0,
            站立_最远振刀距离 = 4,
            站立_振刀延迟 = 0,
            站立_振刀方式 = 招式库.站振,
            站立_触发武器 = {-1},
			站立_执行次数 = 10,
            站立_执行延迟 = 25,
			
			蓄转_最小振刀角度 = 0,
            蓄转_最大振刀角度 = 25,
            蓄转_最近振刀距离 = 0,
            蓄转_最远振刀距离 = 4,
            蓄转_振刀延迟 = 0,
            蓄转_振刀方式 = 招式库.站振,
			蓄转_触发武器 = {-1},
			蓄转_执行次数 = 1,
            蓄转_执行延迟 = 0,
			
			先进_最小振刀角度 = 0,
            先进_最大振刀角度 = 25,
            先进_最近振刀距离 = 0,
            先进_最远振刀距离 = 4,
            先进_振刀延迟 = 0,
            先进_振刀方式 = 招式库.拼刀,
			先进_触发武器 = {-1},
			先进_执行次数 = 1,
            先进_执行延迟 = 0
        },
		["male_katana_attack_heavy_03"] = {
            描述 = "右三连",
            站立_最小振刀角度 = 0,
            站立_最大振刀角度 = 25,
            站立_最近振刀距离 = 0,
            站立_最远振刀距离 = 4,
            站立_振刀延迟 = 0,
            站立_振刀方式 = 招式库.站振,
            站立_触发武器 = {-1},
			站立_执行次数 = 10,
            站立_执行延迟 = 25,
			
			蓄转_最小振刀角度 = 0,
            蓄转_最大振刀角度 = 25,
            蓄转_最近振刀距离 = 0,
            蓄转_最远振刀距离 = 4,
            蓄转_振刀延迟 = 0,
            蓄转_振刀方式 = 招式库.站振,
			蓄转_触发武器 = {-1},
			蓄转_执行次数 = 1,
            蓄转_执行延迟 = 0,
			
			先进_最小振刀角度 = 0,
            先进_最大振刀角度 = 25,
            先进_最近振刀距离 = 0,
            先进_最远振刀距离 = 4,
            先进_振刀延迟 = 0,
            先进_振刀方式 = 招式库.拼刀,
			先进_触发武器 = {-1},
			先进_执行次数 = 1,
            先进_执行延迟 = 0
        }
}

--local 武器类型 = 武器库.取武器分类(武器ID)
function 招式库.查找招式(武器类型, 招式名)
    local 武器招式库 = 招式库[武器类型]
    if 武器招式库 then
        return 武器招式库[招式名]
    else
        return nil
    end
end


function 招式库.是否无触发武器(武器列表,本人武器类型)
	for index, value in pairs(武器列表) do
			if(value==本人武器类型) then 
				return false
			end
	end
	return true
end



function 招式库.是否无武器响应(缓存,是一点零,是蓄转振,本人武器类型)
	if(是一点零==false and 是蓄转振==false) then--判断是否站振
			if(缓存.站立_触发武器[1]~=-1) then
				无触发武器=招式库.是否无触发武器(缓存.站立_振刀方式,本人武器类型)
				if (无触发武器) then 
					return true
				end
			end
		end
		if(是一点零) then 
			if(缓存.先进_触发武器[1]~=-1) then
				无触发武器=招式库.是否无触发武器(缓存.先进_振刀方式,本人武器类型)
				if (无触发武器) then 
					return true
				end
			end
		end
		if(是蓄转振) then
			if(缓存.后进_触发武器[1]~=-1) then
				无触发武器=招式库.是否无触发武器(缓存.后进_振刀方式,本人武器类型)
				if (无触发武器) then 
					return true
				end
			end
		end
	return false
end

return 招式库
